Repository: alireza1219/integrate-zarinpal-edd
Catalog: languages/integrate-zarinpal-edd-*.po
Languages: fa_ir

source: Integrate ZarinPal for EDD
fa_ir: ادغام درگاه پرداخت زرین‌پال برای EDD

source: Zarinpal integration for Easy Digital Downloads.
fa_ir: درگاه پرداخت زرین‌پال را با پلتفرم محبوب Easy Digital Downloads یکپارچه کنید.

source: Alireza Barani
fa_ir: علیرضا بارانی

source: ZarinPal
fa_ir: زرین‌پال

source: ZarinPal Merchant ID
fa_ir: شناسه مرچنت زرین‌پال

source: Enter your ZarinPal Merchant ID here.
fa_ir: شناسه مرچنت درگاه پرداخت زرین پال را در اینجا وارد کنید.

source: Invalid ZarinPal API action provided!
fa_ir: عمل نامعتبری جهت ارتباط با API زرین‌پال ارسال شده است!

source: ZarinPal API Action Error
fa_ir: عمل نامعتبر API زرین‌پال

source: Making API request to %s endpoint
fa_ir: در حال ارسال درخواست به نقطه پایانی %s

source: ZarinPal API Request Failure
fa_ir: خطای درخواست API زرین‌پال

source: ZarinPal payment gateway returned HTTP status code %d
fa_ir: درگاه پرداخت زرین‌پال کد وضعیت %d HTTP را بازگرداند

source: ZarinPal API Status Error
fa_ir: خطای API زرین‌پال

source: Failed to decode ZarinPal API response
fa_ir: رمزگشایی پاسخ دریافت شده از API زرین‌پال با شکست مواجه شد

source: JSON Decode Error
fa_ir: خطای رمزگشایی JSON

source: Request to %s ZarinPal endpoint succeeded
fa_ir: ارسال درخواست از نوع %s به API زرین‌پال با موفقیت انجام شد

source: Nonce verification has failed
fa_ir: عملیات اعتبارسنجی Nonce با شکست مواجه شد

source: Error
fa_ir: خطا

source: Order creation failed before ZarinPal payment request initialization.
fa_ir: ساخت سفارش جدید پیش از ارسال درخواست به درگاه پرداخت زرین‌پال با شکست مواجه شد.

source: ZarinPal Gateway Error
fa_ir: خطای درگاه پرداخت زرین‌پال

source: Order ID: %1$s, Customer Name: %2$s
fa_ir: شماره سفارش: %1$s، نام مشتری: %2$s

source: There was an error while trying to connect to ZarinPal's API.
fa_ir: هنگام تلاش برای اتصال به API زرین‌پال خطایی رخ داد.

source: Error Code %1$s, %2$s
fa_ir: کد خطا %1$s، %2$s

source: Context
fa_ir: اطلاعات بیشتر

source: Not Available
fa_ir: در دسترس نیست

source: Incomplete information provided.
fa_ir: اطلاعات ارسال شده ناقص است.

source: Incorrect IP or merchant code.
fa_ir: آدرس IP و یا شناسه مرچنت پذیرنده صحیح نیست.

source: Payment with the requested amount is not possible due to Shaparak limitations.
fa_ir: با توجه به محدودیت‌های شاپرک، امکان پرداخت با رقم درخواست شده میسر نمی‌باشد.

source: Merchant confirmation level is lower than the Silver level.
fa_ir: سطح تأیید پذیرنده پایین‌تر از سطح نقره ای است.

source: There was a validation error.
fa_ir: خطای اعتبارسنجی رخ داده است.

source: Terminal is not valid. Please check your Merchant ID or IP address.
fa_ir: شناسه مرچنت یا آدرس IP شما معتبر نمی‌باشد. لطفاً نسبت به تصحیح کردن آن اقدام کنید.

source: Terminal is not active. Please contact our support team.
fa_ir: شناسه مرچنت شما فعال نمی‌باشد. لطفاً مشکل خود را به امور مشتریان زرین‌پال ارجاع دهید.

source: Too many attempts, please try again later.
fa_ir: تلاش‌ها بیش از دفعات مجاز تعیین شده در یک بازه زمانی می‌باشد. لطفاً کمی بعد تلاش کنید.

source: Terminal user is suspended.
fa_ir: درگاه پرداخت شما به حالت تعلیق درآمده است. لطفاً مشکل خود را به امور مشتریان زرین‌پال ارجاع دهید.

source: Terminal user level is not valid.
fa_ir: مشکلی در سطح تأیید پذیرنده وجود دارد. لطفاً مشکل خود را به امور مشتریان زرین‌پال ارجاع دهید.

source: No financial operation found for this transaction.
fa_ir: هیچ نوع عملیات مالی برای این تراکنش یافت نشد.

source: The transaction has been unsuccessful.
fa_ir: تراکنش ناموفق می‌باشد.

source: Transaction amount does not match the paid amount.
fa_ir: مبلغ تراکنش با مبلغ پرداخت شده مطابقت ندارد.

source: The transaction has reached the limit for the number or amount of divisions.
fa_ir: سقف تقسیم تراکنش از لحاظ تعداد یا رقم عبور نموده است.

source: An unexpected error has occurred. Please get in touch with the ZarinPal's customer care.
fa_ir: خطای نامشخصی رخ داده است. لطفاً با امور مشتریان زرین‌پال تماس بگیرید.

source: No access permission to the relevant method.
fa_ir: اجازه دسترسی به متد مربوطه وجود ندارد.

source: The provided data related to AdditionalData is invalid.
fa_ir: اطلاعات ارسال شده مرتبط با AdditionalData نامعتبر می‌باشد.

source: The valid lifespan of the payment ID must be between 30 minutes to 45 days.
fa_ir: مدت زمان معتبر طول عمر شناسه پرداخت باید بین ۳۰ دقیقه تا ۴۵ روز باشد.

source: The amount paid is different from the amount sent in the verification method.
fa_ir: مبلغ پرداخت شده با مبلغ ارسال شده از سوی متد اعتبارسنجی متفاوت است.

source: Failed payment.
fa_ir: پرداخت با شکست مواجه شده است.

source: The payment does not belong to this merchant code.
fa_ir: پرداخت فوق به شناسه مرچنت ارسال شده تعلق ندارد.

source: Invalid authority.
fa_ir: آتوریتی (Authority) نامعتبر است.

source: The operation was successful.
fa_ir: عملیات با موفقیت انجام گردیده است.

source: The payment operation was successful, and the payment verification for the transaction has been done before.
fa_ir: عملیات پرداخت موفق بوده و اعتبارسنجی تراکنش قبلاً صورت گرفته است.

source: An unknown error occurred while connecting to the ZarinPal gateway.
fa_ir: خطای نامشخصی هنگام اتصال به درگاه زرین‌پال رخ داده است.

source: Enable ZarinGate
fa_ir: فعال‌سازی زرین‌گیت

source: ZarinPal payment process has begun.
fa_ir: درخواست پرداخت زرین‌پال آغاز شد.

source: ZarinPal payment process was stopped due to a nonce verification problem.
fa_ir: درخواست پرداخت زرین‌پال به دلیل مشکل اعتبارسنجی Nonce متوقف شد.

source: ZarinPal payment process has been completed successfully.
fa_ir: درخواست پرداخت زرین‌پال با موفقیت به اتمام رسید.

source: ZarinPal payment verification has begun.
fa_ir: اعتبارسنجی پرداخت زرین‌پال آغاز شد.

source: ZarinPal payment verification was stopped due to the missing required parameters.
fa_ir: اعتبارسنجی پرداخت زرین‌پال متوقف شد، برخی از پارامترهای مورد نیاز تنظیم نشده‌اند.

source: ZarinPal payment verification was stopped due to a mismatch in the verification hash.
fa_ir: اعتبارسنجی پرداخت زرین‌پال به دلیل وجود مشکل در هش بازگشتی از درگاه پرداخت، متوقف شد.

source: ZarinPal payment verification was stopped due to a missing order record.
fa_ir: اعتبارسنجی پرداخت زرین‌پال متوقف شد، رکورد سفارش یافت نشد.

source: ZarinPal payment verification was stopped because the order is undergoing re-verification.
fa_ir: اعتبارسنجی پرداخت زرین‌پال متوقف شد، سفارش در حال اعتبارسنجی مجدد است.

source: ZarinPal payment verification failed!
fa_ir: اعتبارسنجی پرداخت زرین‌پال با شکست مواجه شد!

source: ZarinPal payment verification has been completed successfully.
fa_ir: اعتبارسنجی پرداخت زرین‌پال با موفقیت انجام شد.

source: ZarinPal payment was successful. Reference ID: %1$s, Authority: %2$s.
fa_ir: پرداخت زرین‌پال موفقیت‌آمیز بود. شماره مرجع: %1$s، شماره آتوریتی: %2$s.
